-- Заполняем роли пользователей в БД
INSERT INTO roles(name) VALUES ('ROLE_USER');
INSERT INTO roles(name) VALUES ('ROLE_ADMIN');


-- Заполняем список тем
INSERT INTO theme(name) VALUES('Спорт');
INSERT INTO theme(name) VALUES('Культура');
INSERT INTO theme(name) VALUES('Экономика');
INSERT INTO theme(name) VALUES('Политика');
INSERT INTO theme(name) VALUES('Наука');
INSERT INTO theme(name) VALUES('Техника');
INSERT INTO theme(name) VALUES('Животные');
INSERT INTO theme(name) VALUES('Юмор');
INSERT INTO theme(name) VALUES('Еда');
INSERT INTO theme(name) VALUES('ЗОЖ');

-- Заполняем администратора
INSERT INTO users(email,first_name,last_name,password) VALUES ('admin@gmail.com','Алексей','Куварин','$2a$12$3dZGz9ppBGRjpVr7uJEyAON6TwGZe4e9Dp3nDF8vQ1IvIfGfDsU0y');


-- Заполняем посты
INSERT INTO posts(header,text,photo,date_published,likes_count,admin_id) VALUES('Нутрициолог рассказала о вреде ночного переедания',
                                                              'В разговоре с «СЭ» нутрициолог Екатерина Стасюк рассказала, почему не стоит увлекаться едой перед сном.По ее словам, ночью наш мозг занят другими процессами — восстановлением и очищением организма. А поздние ужины переключают его на процесс переваривания.«Гормон роста, который вырабатывается во сне, у детей стимулирует процесс развития и восстановления, а у взрослых способствует снижению веса», — отметила эксперт.
                                                            Стасюк утверждает, что небольшие перекусы перед сном безопасны, а вот полноценные приемы пищи способны привести к проблемам со здоровьем: к лишнему весу, к сердечно-сосудистым заболеваниям, расстройству пищевого поведения, изжоге, хронической усталости и обострению хронических заболеваний.
                                                            «Есть связь между приемом пищи и сном. Такое питание может перерасти в привычку и, как следствие, привести к ожирению», — объяснила специалист по питанию.
                                                            Ранее диетолог рассказала о пользе дневного сна.',
                                                              'https://ss.sport-express.ru/userfiles/materials/195/1951938/volga.jpg',
                                                              NOW(),
                                                              0,
                                                              1
                                                              );
INSERT INTO posts(header,text,photo,date_published,likes_count,admin_id) VALUES('Полицейские понаблюдали за пойманной совой и позволили ей понаблюдать за ними',
                                                                               'Житель Ибиня (провинция Сычуань, Китай) обнаружил у себя дома сову и обратился за помощью в полицию.Представители власти забрали птицу, нарушившую границы частной собственности. Правда, прежде чем передать сову в соответствующее ведомство и после выпустить её на волю, пришлось некоторое время подождать.Но полицейские не расстроились. Они привезли сову в участок и не отказали себе в удовольствии понаблюдать за интересной гостьей. Да и сама сова вела себя миролюбиво и с таким же интересом наблюдала за полицейскими. У совы это получалось даже более эффектно. Ведь она, в отличие от людей, способна была поворачивать голову на 360 градусов.',
                                                                                'https://120.su/wp-content/uploads/2023/11/02112023-owl-in-police1.png',
                                                                                NOW() - interval '1 hours',
                                                                                0,
                                                                                1
                                                                               );


INSERT INTO posts(header,text,photo,date_published,likes_count,admin_id) VALUES('Тысячи людей захотели имплантировать себе мозговые чипы компании Маска',
                                                                                'По информации агентства Bloomberg, уже тысячи людей выразили заинтересованность в получении мозговых имплантатов Neuralink.
                                                                                В мае 2023 года американская нейротехнологическая компания Neuralink, основанная Илоном Маском, получила одобрение Управления по санитарному надзору за качеством пищевых продуктов и медикаментов (FDA) на первое клиническое испытание своей технологии на людях.
                                                                                А в сентябре Neuralink открыла набор участников для испытаний имплантируемого беспроводного интерфейса «мозг — компьютер» (BCI). Компания ищет людей с квадриплегией (паралич рук и ног) из-за травмы шейного отдела спинного мозга либо боковым амиотрофическим склерозом (БАС). Цель — создать устройство, которое позволит парализованным людям общаться или играть в игры, используя только свои мысли.
                                                                                На сегодня Neuralink еще не имплантировала свои устройства людям, но планирует прооперировать 11 человек в следующем году и более 22 тысяч к 2030-му. По данным, Bloomberg желающих может быть намного больше. ',
                                                                                'https://naked-science.ru/wp-content/uploads/2023/11/1200x900-768x576.jpg',
                                                                                NOW(),
                                                                                0,
                                                                                1
                                                                               );

INSERT INTO posts(header,text,photo,date_published,likes_count,admin_id) VALUES('"Кинопоиск" представил рейтинг "100 великих фильмов XXI века"',
                                                                                '"Кинопоиск" опросил 230 представителей индустрии и составил рейтинг лучших фильмов столетия, с уточнением - на сегодняшний день. Ранее онлайн-кинотеатр составлял топ-100 сериалов и игр. Проект называется "100 великих".
                                                                                Список фильмов будет опубликован в медиа "Кинопоиска" в несколько этапов. Первые двадцать пять фильмов, с 100 по 75 место, уже стали известны. Лучший фильм XXI века и топ-25 откроются 13 ноября.
                                                                                В опросе приняли участие более 230 представителей индустрии: продюсеры, режиссеры, сценаристы, писатели, участники фестивального движения, кинокритики, журналисты, авторы Telegram-каналов и другие. Каждый из них должен был назвать свою десятку лучших кинокартин кино, вышедших после 1 января 2001 года.
                                                                                На протяжении нескольких месяцев редакция опрашивала деятелей российского кино и культуры. Среди них Клим Шипенко, Валерий Федорович, Евгений Никишов, Яна Вагнер, Макар Кожухов, Константин Майер, Михаил Местецкий, Вячеслав Муругов, Кирилл Соколов, Иван И. Твердовский, Антон Щукин, Иван Самохвалов, Юрий Быков, Петр Буслов, Валерий Тодоровский, Марина Степнова, Алексей Поляринов, Егор Москвитин, Рустам Мосафир, Павел Лунгин, Роман Кантор, Станислав Зельвенский, Адильхан Ержанов, Гавриил Гордеев, Артем Габрелянов и многие другие.
                                                                                В топ-10 они могли включить любой фильм XXI века, не ограничивая себя жанром - в опросе учитывались, в том числе, и документальные и анимационные работы. На основе персональных списков был сформирован топ-100. За первое место фильм получал 10 баллов, за второе - 9 баллов и так далее. А десятое место в личном топе оценивалось в 1 балл. Если фильм входит в дилогию, трилогию или франшизу, то нужно было выбрать только одну его часть. Всего респонденты назвали более 700 фильмов.
                                                                                При просмотре рейтинга обращает на себя внимание то, что он сопровождается комментариями от экспертов. Порой они весьма неожиданны, но помогают лучше понять, почему выбран тот или иной фильм. Вот примеры отзывов.
                                                                                Юрий Быков, режиссер "Майора" и "Дурака", о фильме "Пророк" (86 место):
                                                                                "Это эмоциональный, емкий, яркий, жестокий, жесткий и динамичный фильм. И очень просто рассказанный. История о том, как человек меняется, причем абсолютно любой, даже если он не умеет читать и писать и никому не нужен. Казалось бы, пространство, которое окружает героя, должно его уничтожить. Но он проходит через череду сложных решений и мучительных испытаний, и вот мальчик становится взрослым осознанным мужчиной, который может брать на себя ответственность".
                                                                                Рубен Дишдишян, генеральный продюсер Марс Медиа, о фильме "Аритмия" (79 место):
                                                                                "Борис Хлебников в "Аритмии" попал в очень узнаваемые и понятные людям истории. И образы героев, и ситуации, и личные отношения, и социум, и реалии повседневной жизни. Тут все совпало. Отмечу талантливо сыгранные роли, особенно у Яценко; блестящую операторскую работу... Но главное в этом фильме - это честность. Честность героев. Вне времени. Хлебников нашел этот ключ, показал, что у человека может болеть. Люди разные, а боль у них одинаковая. Хлебников снял фильм про их аритмию, чтобы сердце не черствело, чтобы работало, сопереживая, не останавливаясь. Это фильм про аритмию разных сердец".
                                                                                Между тем
                                                                                Сотрудники "Кинопоиска" посчитали и обработали интересные факты о рейтинге. Приведем их.
                                                                                1. Абсолютное большинство фильмов в топ-100 - художественные, их 92. Также в список попали 7 анимационных фильмов и 1 документальный.
                                                                                2. Квентин Тарантино - рекордсмен по числу фильмов в топ-100, в список вошло 5 его фильмов.
                                                                                3. В рейтинг попали 4 фильма братьев Коэнов и 4 фильма Кристофера Нолана, а также по 3 фильма Дени Вильнёва, Андрея Звягинцева и Мартина Макдоны.
                                                                                4. 2001 год - самый урожайный на великие фильмы. В список вошло 10 картин, выпущенных в этом году.
                                                                                5. В топ-100 нет ни одной картины 2020-го и 2023-го года.
                                                                                График выхода рейтинга "100 великих фильмов XXI века"
                                                                                - Места с 100 по 76 - читайте на "Кинопоиске".
                                                                                - Места с 76 по 51 будут опубликованы 8 ноября.
                                                                                - Места с 50 по 26 - 9 ноября.
                                                                                - Места с 25 по 1 - 13 ноября.',
                                                                                'https://www.google.com/url?sa=i&url=https%3A%2F%2Fwww.kinopoisk.ru%2Fmedia%2Fnews%2F4005309%2F&psig=AOvVaw1K3i1M8kApRTQJDT32oB8o&ust=1699545291670000&source=images&cd=vfe&opi=89978449&ved=0CA8QjRxqFwoTCMDg_d3htIIDFQAAAAAdAAAAABAD',
                                                                                NOW() - interval '2 hours',
                                                                                0,
                                                                                1
                                                                               );

INSERT INTO posts(header,text,photo,date_published,likes_count,admin_id) VALUES('Сбербанк повысил ставки по ипотеке',
                                                                                'Сбербанк повысил минимальную ставку по базовым ипотечным программам до 15,6%
                                                                                После повышения ключевой ставки ЦБ до 15% ряд крупных российских банков уже объявил о повышении ставок по ипотеке, в их числе ВТБ, Альфа-банк и «Открытие». Сбербанк повысил ипотечные ставки сразу на 1,4 п.п. — до 15,6% Сбербанк с пятницы, 3 ноября, повышает ставки по ипотеке на первичном и вторичном рынках на 1,4 п.п., минимальная теперь составляет 15,6%, сообщили РБК в пресс-службе кредитной организации.
                                                                                «Сбер» с 3 ноября меняет ставки по ипотеке по базовым программам в связи с повышением 27 октября Банком России ключевой ставки с 13 до 15% годовых. Минимальная ставка по программам на приобретение готового и строящегося жилья составит 15,6% годовых. «Сбер» скорректировал ставки на 1,4 п.п. в то время как рост ключевой ставки составил 2 п.п.», — говорится в сообщении.
                                                                                При этом по программам с господдержкой ставки не поменяются: минимальная ставка по программе «Господдержка» начинается также от 8% годовых, по «Семейной ипотеке» — от 6% годовых. «Кредит по программе «Ипотека для IT» можно оформить по еще более низкой ставке — от 5% годовых», — добавили в Сбербанке.',
                                                                                'https://s0.rbk.ru/v6_top_pics/resized/590xH/media/img/4/10/346989617156104.webp',
                                                                                NOW() - interval '24 hours',
                                                                                0,
                                                                                1
                                                                               );

INSERT INTO posts(header,text,photo,date_published,likes_count,admin_id) VALUES('В Пермском Политехе разработали сенсорный экран, реагирующий на звук касания',
                                                                                'Обычные пульты управления с кнопками плохо работают в агрессивной среде, пыль и влага проникают в щели. При этом кнопки часто ломаются. А ведь сенсорные экраны стали основным интерфейсом ввода информации для мобильных телефонов, планшетов, ПК общего назначения и терминалов. Однако, как правило, они сделаны из хрупких материалов и имеют много ограничений (должны быть плоскими и однородными). Из-за этого устройства становятся менее универсальными и надежными. Было бы удобно иметь сенсорный экран из прочного металла или пластика. Ученые Пермского Политеха разработали новый сенсорный экран, который определяет точку касания по звуку. По поверхности распространяются звуковые волны, и по времени распространения волны можно точно определить место касания. Поверхность при этом может быть любой формы и размера, сделана из любого материала, а кнопки — просто нарисованы. Система, по словам ученых, долговечная, вандалоустойчивая и точная.
                                                                                Исследование опубликовано в журнале «Вестник ПНИПУ. Электротехника, информационные технологии, система управления». Исследование выполнено при поддержке гранта «Умник-ИИ 2021».
                                                                                «При касании пользователем экрана образуется ударная волна, которая распространяется по сенсорной панели. Микрофоны, расположенные в ее внутренней части, регистрируют звуковые колебания, на разные микрофоны звук приходит в свое время. Далее их показания передаются в микроконтроллер и там обрабатываются – рассчитываются относительная временная задержка и сила сигнала, по которым можно вычислить расстояние и место касания пользователя», – объясняет ассистент кафедры «Автоматика и телемеханика» Пермского Политеха Алексей Козин.
                                                                                В ходе исследования ученые смоделировали сенсорное акустическое устройство. Математическая модель определяет распространение звука в твердых телах и его локализацию с учетом временной задержки и громкости.
                                                                                Политехники создали модель в программном комплексе в виде полой металлической конструкции (20 сантиметров в ширину, 30 — в длину и 10 — в высоту), к внутренней части стенок прикреплены три микрофона. При моделировании ученые использовали безэховую среду и одиночное касание по центру. Были определены силы сигнала и пиковое значение волн.
                                                                                Чтобы проверить возможность реализации системы на практике ученые провели эксперимент, для которого использовали алюминиевую коробку. Координаты микрофонов и касания полностью соответствуют модели, примерная длительность касания 85 мс, а его пиковое значение происходило в момент времени 900 мкс. В результате первым звуковую волну зарегистрировал микрофон №3 (ближайший к касанию), а микрофон №1 – последним. Временная задержка между третьим и вторым микрофоном 109,4, а между третьим и первым – 201,6.
                                                                                «Акустический сенсор получается очень дешевым и позволяет делать экран из любого материала – из куска металла и даже из деревянной доски. Испытания на вибростенде показали высокую помехоустойчивость нашего сенсора. Прямо сейчас мы со своим проектом прошли в финал конкурса-акселератора инновационных проектов «Большая разведка», в рамках которого нам предложили сотрудничество с несколькими предприятиями, занимающихся производством пультов управления. Оказалось, что наиболее востребовано использование нашего сенсорного экрана в шахтном оборудовании, где большая запыленность воздуха приводит к очень быстрому износу устройств», – рассказывает аспирант кафедры «Информационные технологии и автоматизированные системы» ПНИПУ Анна Якубчик.
                                                                                Полученные результаты эксперимента соответствуют всем расчетным и компьютерным значениям. Разработанная учеными система позволяет точно определять место контакта пользователя с сенсорным экраном через звуковые волны, следующие после касания. Технология долговечная, вандалоустойчивая и не подвержена изменениям погодных условий. Поэтому ее использование на сенсорных устройствах в уличной и неблагоприятной среде эффективно и перспективно.',
                                                                                'https://naked-science.ru/wp-content/uploads/2023/11/Alexey_Kozin-768x576.jpg',
                                                                                NOW() - interval '1 hours',
                                                                                0,
                                                                                1
                                                                               );

-- Заполняем темы для постов
INSERT INTO post_themes(post_id,theme_id) VALUES (1,9);
INSERT INTO post_themes(post_id,theme_id) VALUES (1,10);
INSERT INTO post_themes(post_id,theme_id) VALUES (2,7);
INSERT INTO post_themes(post_id,theme_id) VALUES (2,8);
INSERT INTO post_themes(post_id,theme_id) VALUES (3,5);
INSERT INTO post_themes(post_id,theme_id) VALUES (3,6);
INSERT INTO post_themes(post_id,theme_id) VALUES (4,2);
INSERT INTO post_themes(post_id,theme_id) VALUES (5,3);
INSERT INTO post_themes(post_id,theme_id) VALUES (6,5);
INSERT INTO post_themes(post_id,theme_id) VALUES (6,6);


-- Заполним несколько USERS
INSERT INTO users(email,first_name,last_name,password) VALUES ('user1@gmail.com','Иван','Иванович','$2a$12$3dZGz9ppBGRjpVr7uJEyAON6TwGZe4e9Dp3nDF8vQ1IvIfGfDsU0y');
INSERT INTO users(email,first_name,last_name,password) VALUES ('user2@gmail.com','Петр','Петрович','$2a$12$3dZGz9ppBGRjpVr7uJEyAON6TwGZe4e9Dp3nDF8vQ1IvIfGfDsU0y');
INSERT INTO users(email,first_name,last_name,password) VALUES ('user3@gmail.com','Кузьма','Кузьмич','$2a$12$3dZGz9ppBGRjpVr7uJEyAON6TwGZe4e9Dp3nDF8vQ1IvIfGfDsU0y');
INSERT INTO users(email,first_name,last_name,password) VALUES ('user4@gmail.com','Сергей','Сергеевич','$2a$12$3dZGz9ppBGRjpVr7uJEyAON6TwGZe4e9Dp3nDF8vQ1IvIfGfDsU0y');

-- Заполним предпочтения некоторых USERS
INSERT INTO user_preferences(user_id,theme_id,type) VALUES(2,9,true);
INSERT INTO user_preferences(user_id,theme_id,type) VALUES(2,7,false);

INSERT INTO user_preferences(user_id,theme_id,type) VALUES(3,5,true);
INSERT INTO user_preferences(user_id,theme_id,type) VALUES(3,6,true);
INSERT INTO user_preferences(user_id,theme_id,type) VALUES(3,8,false);


-- Заполним комментарии некоторых USERS
INSERT INTO comments(user_id,post_id,date_published,text) VALUES (2,6,NOW()-interval '2 minutes','О, Пермский политех, я тут учился! Молодцы ребята!');
INSERT INTO comments(user_id,post_id,date_published,text) VALUES (3,6,NOW()-interval '1 minute','А меня отчислили за неуспеваемость, год до диплома не дотянул((');


-- Заполним лайки некоторых USERS
INSERT INTO likes(user_id,post_id) VALUES (2,6);
INSERT INTO likes(user_id,post_id) VALUES (3,6);

-- Обновим лайки в постах
UPDATE posts
SET likes_count = likes_count + 2
WHERE id=6;






















